tutorials/19Explicit/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
400
(
(0.0893712 -0.0913793 0)
(0.010218 0.0638925 0)
(-0.548077 0.232829 0)
(-1.46117 0.341334 0)
(-2.57215 0.396415 0)
(-3.7588 0.41195 0)
(-4.92214 0.39527 0)
(-5.97091 0.346882 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           uniform (407.983 0 0);
    }
    fixedWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

