tutorials/19Explicit/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 50;
NmodesUproj 5;
NmodesPout 50;
NmodesPproj 5;
NmodesSUPout 0;
NmodesSUPproj 0;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Specific problem of a stationary case
tolerance 1e-6;

// Reduced simple cicle parameters
residualJumpLim 1e-8;
normalizedResidualLim 1e-8;

bcMethod none

timeDerivativeSchemeOrder first

// Inlet boundary conditions velocities.
online_velocities vel.txt;

debug 1;


